app/Views/peminjaman/index.php

SELECT *
FROM `transaksi`
WHERE `id_peminjaman` = '209'
AND `jenis` = 'pengiriman'
---
                                            <!-- CEK TRANSAKSI -->
                                            <?php
                                            $db = \Config\Database::connect();
                                            $transaksi = $db->table('transaksi')
                                                ->where('id_peminjaman', $p['id_peminjaman'])
                                                ->where('jenis', 'pengiriman')
                                                ->get()
                                                ->getRowArray();