app/Controllers/Dashboard.php

                ->get()
                ->getRow();

            $data = [
                'total_buku' => $buku->countAll(),
                'total_user' => $user->countAll(),
                'total_peminjaman' => $pinjam->countAll(),
                'total_pengembalian' => $kembali->countAll(),
                'total_denda' => $row->denda ?? 0,
            ];
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `buku`

    public function stats()
    {
        $role = session()->get('role');
        $id   = session()->get('id');

        $db = \Config\Database::connect();

        $buku = new BukuModel();
        $user = new UsersModel();
        $pinjam = new PeminjamanModel();
        $kembali = new PengembalianModel();

        if ($role == 'anggota') {

            $dipinjam = $pinjam->where('id', $id)->countAllResults();

            $pengembalian = $db->table('pengembalian')
                ->join('peminjaman', 'peminjaman.id_peminjaman = pengembalian.id_peminjaman')
                ->where('peminjaman.id', $id)
                ->countAllResults();

            $row = $db->table('pengembalian')
                ->join('peminjaman', 'peminjaman.id_peminjaman = pengembalian.id_peminjaman')
                ->where('peminjaman.id', $id)
                ->selectSum('denda')
                ->get()
                ->getRow();

            return $this->response->setJSON([
                'buku' => $buku->countAll(),
                'dipinjam' => $dipinjam,
                'pengembalian' => $pengembalian,
                'denda' => $row->denda ?? 0,
            ]);
        }

        return $this->response->setJSON([
            'buku' => $buku->countAll(),
            'user' => $user->countAll(),
            'dipinjam' => $pinjam->countAll(),
            'pengembalian' => $kembali->countAll(),
            'denda' => $db->table('pengembalian')->selectSum('denda')->get()->getRow()->denda ?? 0,
        ]);
---
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `id` = '2'
SELECT COUNT(*) AS `numrows`
FROM `pengembalian`
JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `pengembalian`.`id_peminjaman`
WHERE `peminjaman`.`id` = '2'
SELECT SUM(`denda`) AS `denda`
FROM `pengembalian`
JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `pengembalian`.`id_peminjaman`
WHERE `peminjaman`.`id` = '2'
SELECT COUNT(*) AS `numrows` FROM `peminjaman`
SELECT COUNT(*) AS `numrows` FROM `buku`
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `pengembalian`
SELECT SUM(`denda`) AS `denda`
FROM `pengembalian`