app/Controllers/Dashboard.php

    public function stats()
{
    $buku = new BukuModel();
    $user = new UsersModel();
    $pinjam = new PeminjamanModel();
    $kembali = new PengembalianModel();

    return $this->response->setJSON([
        'buku' => $buku->countAll(),
        'user' => $user->countAll(),
        'dipinjam' => $pinjam->countAll(),
        'pengembalian' => $kembali->countAll(),
---
SELECT COUNT(*) AS `numrows` FROM `peminjaman`
SELECT COUNT(*) AS `numrows` FROM `pengembalian`