app/Controllers/Kategori.php

SELECT *
FROM `kategori`
WHERE `is_deleted` = 0
---
                ->where('is_deleted', 0)
                ->findAll();
        } else {
            $data['kategori'] = $model
                ->where('is_deleted', 0)
                ->findAll();