app/Controllers/Peminjaman.php

INSERT INTO `peminjaman` (`tanggal_pinjam`, `tanggal_kembali`, `status`, `id`, `id_buku`, `metode`) VALUES ('2026-04-21', '2026-04-26', 'dipinjam', '2', '25', 'ambil')
---
    public function store()
    {
        $tanggal_pinjam = $this->request->getPost('tanggal_pinjam');
        $metode = $this->request->getPost('metode');
        $id_buku_list = $this->request->getPost('id_buku');

        if (!is_array($id_buku_list)) {
            $id_buku_list = [$id_buku_list];
        }

        $tanggal_kembali = date('Y-m-d', strtotime($tanggal_pinjam . ' +5 days'));

        // 🔥 WAJIB: awalnya MENUNGGU
        $status = 'menunggu';

        // SIMPAN HEADER
        $this->peminjaman->insert([
            'tanggal_pinjam'  => $tanggal_pinjam,
            'tanggal_kembali' => $tanggal_kembali,
            'status'          => $status,
            'id'              => session()->get('id'),
            'metode'          => $metode
        ]);