app/Controllers/Peminjaman.php

    public function create()
    {
        $bukuModel = new \App\Models\BukuModel();

        $data['buku'] = $bukuModel
            ->select('buku.*, kategori.nama_kategori, penulis.nama_penulis, penerbit.nama_penerbit')
            ->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left')
            ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left')
            ->join('penerbit', 'penerbit.id_penerbit = buku.id_penerbit', 'left')
            ->findAll();
---
SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`


        // =========================
        // SIMPAN PEMINJAMAN
        // =========================
        $this->peminjaman->insert([
            'tanggal_pinjam'  => $tanggal_pinjam,
            'tanggal_kembali' => $tanggal_kembali,
            'status'          => $status,
            'id'              => session()->get('id'),
            'metode'          => $metode
        ]);
---
INSERT INTO `peminjaman` (`tanggal_pinjam`, `tanggal_kembali`, `status`, `id`, `metode`) VALUES (NULL, NULL, 'menunggu', '7', 'ambil')

        // =========================
        if ($metode == 'ambil') {
            foreach ($id_buku_list as $id_buku) {
                $db->table('buku')
                    ->where('id_buku', $id_buku)
                    ->set('tersedia', 'tersedia - 1', false)
                    ->update();
---
UPDATE `buku` SET `tersedia` = tersedia - 1
WHERE `id_buku` = '23'

    public function setujui($id)
    {
        $db = \Config\Database::connect();

        $db->table('peminjaman')
            ->where('id_peminjaman', $id)
            ->update([
                'status' => 'dipinjam',
                'tanggal_pinjam' => date('Y-m-d'),
                'tanggal_kembali' => date('Y-m-d', strtotime('+5 days')),
                'petugas_id' => session()->get('id')
            ]);
---
UPDATE `peminjaman` SET `status` = 'dipinjam', `tanggal_pinjam` = '2026-04-26', `tanggal_kembali` = '2026-05-01', `petugas_id` = '3'
WHERE `id_peminjaman` = '207'