app/Controllers/Penarikan.php

    public function proses($id)
    {
        $this->penarikan->update($id, [
            'status' => 'diproses',
            'petugas_id' => session()->get('id')
        ]);
---
SELECT `penarikan`.*, `peminjaman`.`tanggal_pinjam`, `peminjaman`.`tanggal_kembali`, `users`.`nama` as `nama_petugas`
FROM `penarikan`
LEFT JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `penarikan`.`id_peminjaman`
LEFT JOIN `users` ON `users`.`id` = `penarikan`.`petugas_id`
WHERE `peminjaman`.`id` = '7'

    public function selesai($id)
    {
        $db = \Config\Database::connect();

        $penarikan = $db->table('penarikan')
            ->where('id_penarikan', $id)
            ->get()
            ->getRowArray();

        if (!$penarikan) {
            return redirect()->back();
        }

        // update penarikan
        $db->table('penarikan')
            ->where('id_penarikan', $id)
            ->update([
                'status' => 'selesai'
            ]);

        // update peminjaman jadi dikembalikan
        $db->table('peminjaman')
            ->where('id_peminjaman', $penarikan['id_peminjaman'])
            ->update([
                'status' => 'dikembalikan'
            ]);
---
SELECT *
FROM `penarikan`
WHERE `id_penarikan` = '10'
UPDATE `penarikan` SET `status` = 'selesai'
WHERE `id_penarikan` = '10'
UPDATE `peminjaman` SET `status` = 'dikembalikan'
WHERE `id_peminjaman` = '198'