app/Controllers/Pengembalian.php

SELECT *
FROM `pengembalian`
---
    public function index()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('pengembalian');

        $builder->select('
            pengembalian.*,
            users.nama,
            peminjaman.tanggal_pinjam,
            peminjaman.tanggal_kembali,
            denda.status as status_denda
        ');

        $builder->join('peminjaman', 'peminjaman.id_peminjaman = pengembalian.id_peminjaman');
        $builder->join('users', 'users.id = peminjaman.id');
        $builder->join('denda', 'denda.id_pengembalian = pengembalian.id_pengembalian', 'left');

        $builder->orderBy('pengembalian.id_pengembalian', 'DESC');

        $data['pengembalian'] = $builder->get()->getResultArray();