app/Controllers/Pengembalian.php

INSERT INTO `pengembalian` (`id_peminjaman`, `tanggal_dikembalikan`, `denda`) VALUES ('155', '2026-05-02', 20575000)
---
    public function store()
    {
        $model = new \App\Models\PengembalianModel();

        $tanggal_dikembalikan = $this->request->getPost('tanggal_dikembalikan');
        $tanggal_kembali = $this->request->getPost('tanggal_kembali');

        // hitung denda (contoh 1000 per hari telat)
        $denda = 0;
        if ($tanggal_dikembalikan > $tanggal_kembali) {
            $telat = (strtotime($tanggal_dikembalikan) - strtotime($tanggal_kembali)) / 86400;
            $denda = $telat * 1000;
        }

        $model->save([
            'id_peminjaman' => $this->request->getPost('id_peminjaman'),
            'tanggal_dikembalikan' => $tanggal_dikembalikan,
            'denda' => $denda
        ]);