app/Controllers/Pengiriman.php

    public function antar($id)
    {
        $db = \Config\Database::connect();

        $db->table('pengiriman')
            ->where('id_peminjaman', $id)
            ->update([
                'status' => 'dikirim',
                'tanggal_kirim' => date('Y-m-d')
            ]);
---
UPDATE `pengiriman` SET `status` = 'dikirim', `tanggal_kirim` = '2026-04-21'
WHERE `id_peminjaman` = '139'