app/Models/BukuModel.php

SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`, `rak`.`nama_rak`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `rak_buku` ON `rak_buku`.`id_buku` = `buku`.`id_buku`
LEFT JOIN `rak` ON `rak`.`id_rak` = `rak_buku`.`id_rak`
---
    public function getBuku($keyword = null)
    {
        $builder = $this->db->table('buku');

        $builder->select('
            buku.*,
            kategori.nama_kategori,
            penulis.nama_penulis,
            penerbit.nama_penerbit,
            rak.nama_rak
        ');

        $builder->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left');
        $builder->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left');
        $builder->join('penerbit', 'penerbit.id_penerbit = buku.id_penerbit', 'left');
        $builder->join('rak_buku', 'rak_buku.id_buku = buku.id_buku', 'left');
        $builder->join('rak', 'rak.id_rak = rak_buku.id_rak', 'left');


    if (!empty($keyword)) {
        $builder->groupStart()
            ->like('buku.judul', $keyword)
            ->orLike('buku.isbn', $keyword)
            ->orLike('kategori.nama_kategori', $keyword)
            ->orLike('penulis.nama_penulis', $keyword)
            ->orLike('penerbit.nama_penerbit', $keyword)
            ->orLike('rak.nama_rak', $keyword)
        ->groupEnd();
    }

    return $builder->get()->getResultArray();